`timescale  1ns/1ns
////////////////////////////////////////////////////////////////////////
// Author  : EmbedFire
// 实验平台: 野火FPGA系列开发板
// 公司    : http://www.embedfire.com
// 论坛    : http://www.firebbs.cn
// 淘宝    : https://fire-stm32.taobao.com
////////////////////////////////////////////////////////////////////////

module  led
(
    input   wire    key_in  ,   //输入按键

    output  wire    led_out     //输出控制led灿
);

//********************************************************************//
//***************************** Main Code ****************************//
//********************************************************************//

//led_out:led灯输出的结果为key_in按键取反的输入忿
assign  led_out  =  ~key_in;

endmodule
